app/Http/Controllers/EmployeesController.php

delete from `payroll` where `id` = 3
---
    public function payroll_delete(Request $request, $id)
    {
      $payroll = Payroll::findOrFail($id);
      $payroll->delete();

update `payroll` set `cost` = '1.00', `addl_pay` = '2', `deduction` = '3', `remarks` = '4', `updated_by` = 1, `from_date` = '2020-10-02 00:00:00', `to_date` = '2020-10-31 00:00:00', `payroll`.`updated_at` = '2020-10-31 14:42:07' where `id` = '1'
---
    public function payroll_update(Request $request, $id)
    {
      $validatedData = $request->validate([
        'cost' => 'required|max:20',
        'addl_pay' => 'max:20',
        'deduction' => 'max:20',
        'cost' => 'max:20',
        'remarks'=> 'max:50'
      ]);

      $user = auth()->user();

      $from_date = date('Y-m-d H:i:s', strtotime($request->from_date));
      $to_date = date('Y-m-d H:i:s', strtotime($request->to_date));

      Payroll::whereId($id)->update($validatedData +[
          'updated_by' => $user->id,
          'from_date' => $from_date,
          'to_date' => $to_date
      ]);