app/Http/Controllers/ItemsController.php

select * from `items`
select * from `suppliers` where `suppliers`.`id` in (1, 2)
---
    public function index()
    {
        //
        $items = Item::with('suppliers')->get();

select * from `items` where `name_long` = 'tes' limit 1
---
    public function store(Request $request)
    {
        //
        $user = auth()->user();


        $item_exist = Item::where('name_long', '=', $request->name_long)->first();

select * from `suppliers`
---
    public function edit($id)
    {
        //
        $items = Item::findOrFail($id);

        $suppliers = Supplier::all();

update `items` set `supplier_id` = '2', `name_long` = '1', `unit` = '2', `remarks` = '3', `updated_by` = 1, `items`.`updated_at` = '2020-10-31 15:04:55' where `id` = '15'
---
    public function update(Request $request, $id)
    {
        //
        $validatedData = $request->validate([
            'supplier_id' => 'required|max:255',
            'name_short' => 'max:255',
            'name_long' => 'required|max:255',
        ]);

        $user = auth()->user();

        Item::whereId($id)->update($validatedData + [
            'updated_by' => $user->id,
        ]);