app/Http/Controllers/PurchasesController.php

    public function edit($id)
    {
        //
        $purchases = Purchase::findOrFail($id);

        $items = Item::all();
---
select * from `items`