app/Http/Controllers/PurchasesController.php

select * from `items`
---
    public function index()
    {
        //
        $items = Item::all();

select * from `items`
---
    public function edit($id)
    {
        //
        $purchases = Purchase::findOrFail($id);

        $items = Item::all();

update `purchases` set `dr_no` = 'DRNUMBER', `qty` = '21', `updated_by` = 1, `received_at` = '', `created_at` = '1970-01-01 08:00:00', `purchases`.`updated_at` = '2020-10-31 22:10:57' where `id` = '42'
---
    public function update(Request $request, $id)
    {
        //
        if(!is_null($request->received_at) && $request->received_at != '') {
          $receive_date = date('Y-m-d H:i:s', strtotime($request->received_at));
        } else {
          $receive_date = NULL;
        }

        $validatedData = $request->validate([
            'dr_no' => 'required|max:20',
            'qty' => 'required|max:10',
        ]);

        $user = auth()->user();

        $order_date = date('Y-m-d H:i:s', strtotime($request->order_date));

        Purchase::whereId($id)->update($validatedData +[
            'updated_by' => $user->id,
            'received_at' => $receive_date,
            'created_at' => $order_date
        ]);