app/Http/Controllers/SalesController.php

    public function point_of_sale()
    {
      $clients = Client::all();
---
select * from `clients`